Tekla.Structures.Model.RebarSplitter
The RebarSplitter class represents a modifier that can split the Tekla.Structures.Model.RebarSet reinforcing bars that pass through it.
The following example shows how to create and add a RebarSplitter, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create and insert a rebarset (see the RebarSet example).
var rebarSet = new RebarSet();
// Create the RebarSplitter
var strip = new RebarSplitter();
strip.Father = rebarSet;
strip.LapLength = 100;
strip.StaggerType = RebarSplitter.StaggerTypeEnum.STAGGER_LEFT;
strip.StaggerOffset = 200;
strip.SplitOffset = 50;
strip.Curve.AddContourPoint(new ContourPoint(new Point(400, 200, 0), null));
strip.Curve.AddContourPoint(new ContourPoint(new Point(400, 1000, 0), null));
strip.Insert();
}
}

Tekla.Structures.Model.RebarSplitter.LapLength
Gets or sets the lap length.
Negative values will define a gap rather than a lap.

Tekla.Structures.Model.RebarSplitter.BarsToSplit
Gets or sets the reinforcing bars to split.

Tekla.Structures.Model.RebarSplitter.LapSide
Gets or sets the side of the split that the lap is located.

Tekla.Structures.Model.RebarSplitter.LapPlacement
Gets or sets the placement of the lap relative to the associated Tekla.Structures.Model.RebarLegFace.

Tekla.Structures.Model.RebarSplitter.LapType
Gets or sets the lap type.